<template>
  <footer>
    <div class="row">
      <div class="info">
        <div class="logo">
          <svg xmlns="http://www.w3.org/2000/svg" width="140" height="41" viewBox="0 0 140 41" fill="none">
            <path d="M25.6809 4.71708H0V13.4764H8.28797V39.4087H17.4244V13.4764H25.6809V4.71708Z" fill="#F2F2F2"/>
            <path d="M96.5019 39.4087L90.5078 24.9774L91.0106 24.5768C94.043 22.2043 95.512 19.3762 95.512 15.9432C95.512 12.5101 94.3336 9.83912 91.8983 7.63947C89.7458 5.69906 86.627 4.71708 82.6284 4.71708H69.5876V39.4087H78.7161V12.8087H81.4814C85.6529 12.8087 86.2735 14.9612 86.2735 16.2417C86.2735 17.6557 85.7236 20.0204 82.0156 20.0204H80.0909V24.3175L86.9648 39.4087H96.5019Z" fill="#F2F2F2"/>
            <path d="M118.365 39.4087H127.831L118.491 21.568L127.493 4.71708H118.412L114.515 14.152L109.676 4.71708H100.32L109.346 21.8744L99.8092 39.4087H109.024L113.306 29.4396L118.365 39.4087Z" fill="#F2F2F2"/>
            <path d="M59.6027 9.17923C56.099 5.61265 51.8411 3.80579 46.9469 3.80579C41.762 3.80579 37.3234 5.58908 33.7489 9.10853C30.1745 12.6201 28.3598 16.9723 28.3598 22.0472C28.3598 27.0671 30.1588 31.4114 33.7097 34.9623C37.2605 38.5132 41.6048 40.3122 46.6248 40.3122C51.684 40.3122 56.0361 38.521 59.5634 34.9859C63.0986 31.4507 64.8897 27.0985 64.8897 22.0472C64.8897 17.0744 63.1064 12.7458 59.6027 9.17923ZM58.385 18.9755C57.2617 20.0047 56.7117 21.0573 56.7196 22.0865C56.7196 23.0842 57.2852 24.0976 58.3693 25.0796C59.7048 26.2894 60.0348 27.9077 59.2335 29.306C58.385 30.783 56.8139 31.3014 55.0384 30.6887C53.7344 30.2409 52.5795 30.2723 51.6997 30.7751C50.812 31.2857 50.1913 32.2991 49.9085 33.7053C49.5629 35.4336 48.3059 36.5728 46.7112 36.612C46.6798 36.612 46.6562 36.612 46.6248 36.612C44.9986 36.612 43.7259 35.4729 43.3646 33.6975C43.0896 32.3149 42.469 31.3172 41.5813 30.7987C40.6936 30.288 39.5309 30.2488 38.2111 30.6887C36.42 31.2857 34.8566 30.7672 34.016 29.2903C33.1833 27.8291 33.5447 26.2658 34.998 24.9853C36.0036 24.0976 36.5378 23.092 36.5456 22.0708C36.5456 21.0338 36.0036 20.0047 34.9666 19.0855C33.5368 17.8207 33.199 16.2103 34.0553 14.7648C34.9195 13.3114 36.4514 12.8322 38.2582 13.445C39.5309 13.8771 40.6778 13.8221 41.5813 13.2957C42.4847 12.7694 43.0975 11.7952 43.3567 10.4755C43.7181 8.64503 44.9672 7.50592 46.6248 7.49807H46.6326C48.2745 7.49807 49.5629 8.66074 49.9164 10.4676C50.1756 11.811 50.7727 12.7851 51.6368 13.2957C52.5324 13.8221 53.7344 13.8535 55.117 13.3978C56.2561 13.0208 57.4031 13.1779 58.2751 13.8221C59.1864 14.4977 59.6734 15.3147 59.642 16.6345C59.642 17.2315 59.3906 18.0407 58.3772 18.9677L58.385 18.9755Z" fill="#F2F2F2"/>
            <path d="M135.624 0.24707C136.378 0.24707 137.093 0.435612 137.777 0.812695C138.468 1.18978 139.01 1.72398 139.403 2.42315C139.796 3.12233 140 3.85293 140 4.62281C140 5.38483 139.804 6.10757 139.419 6.79889C139.034 7.49021 138.492 8.02441 137.808 8.40935C137.117 8.79429 136.394 8.99069 135.632 8.99069C134.87 8.99069 134.147 8.79429 133.464 8.40935C132.773 8.02441 132.238 7.49021 131.846 6.79889C131.468 6.10757 131.272 5.38483 131.272 4.62281C131.272 3.86078 131.468 3.13019 131.861 2.42315C132.254 1.72398 132.796 1.18978 133.48 0.812695C134.155 0.435612 134.878 0.24707 135.624 0.24707ZM135.632 1.10336C135.027 1.10336 134.454 1.25263 133.904 1.55115C133.354 1.84967 132.922 2.28175 132.6 2.84737C132.278 3.40514 132.121 4.00219 132.121 4.61495C132.121 5.22771 132.27 5.80905 132.584 6.36682C132.89 6.92459 133.322 7.35666 133.88 7.66304C134.43 7.97728 135.019 8.13439 135.624 8.13439C136.237 8.13439 136.811 7.97728 137.368 7.66304C137.918 7.35666 138.358 6.91673 138.664 6.36682C138.979 5.80905 139.128 5.22771 139.128 4.61495C139.128 4.00219 138.963 3.413 138.657 2.84737C138.342 2.28175 137.902 1.84967 137.353 1.55115C136.795 1.25263 136.221 1.10336 135.624 1.10336H135.632ZM133.66 2.32103H134.595C135.475 2.32103 135.97 2.32103 136.08 2.32888C136.386 2.36031 136.63 2.4153 136.81 2.51743C136.983 2.61955 137.125 2.76096 137.243 2.95736C137.353 3.16161 137.415 3.38157 137.415 3.62511C137.415 3.95506 137.305 4.24572 137.085 4.4814C136.865 4.72493 136.559 4.86634 136.166 4.92919C136.308 4.98418 136.41 5.03917 136.488 5.10202C136.567 5.16486 136.677 5.2827 136.803 5.45553C136.842 5.50267 136.952 5.69121 137.148 6.02116L137.69 6.95601H136.528L136.135 6.2097C135.876 5.69907 135.656 5.38483 135.491 5.25128C135.318 5.11773 135.098 5.05488 134.839 5.05488H134.595V6.95601H133.66V2.32103ZM134.595 4.31643H134.98C135.522 4.31643 135.86 4.29286 135.993 4.25358C136.127 4.20644 136.221 4.13574 136.3 4.03361C136.386 3.93149 136.418 3.81365 136.418 3.6801C136.418 3.54655 136.386 3.43657 136.308 3.33444C136.237 3.23231 136.127 3.16161 135.986 3.11447C135.852 3.07519 135.514 3.05163 134.98 3.05163H134.595V4.31643Z" fill="#F2F2F2"/>
          </svg>
        </div>
        <p>
          Наши современные инструменты сочетают в себе высокую мощность, надежность и эргономику, чтобы обеспечить максимальную эффективность и комфорт в работе.
        </p>
        <button-red>
          Специальное предложение
        </button-red>
      </div>
      <div class="links-wrapper">
        <div class="nav-wrapper" v-for="nav of links" :key="nav.name">
          <h3>{{ nav.name }}</h3>
          <div class="links" v-for="link of nav.links">
            <router-link :to="link.link">
              {{ link.name }}
            </router-link>
          </div>
        </div>
      </div>
    </div>
    <div class="row">
      <div class="copyright">
        © ООО "Компания Политех-инструмент", 2024, 142006, Московская область, г. Домодедово, мкр. Востряково, владение "Триколор", стр. 15, оф. 303
      </div>
    </div>
  </footer>
</template>

<script setup>
import torxLogo from '@/assets/logos/torx.webp'
import ButtonRed from "@/components/Layout/Buttons/ButtonRed.vue";
const links = {
  nav: {
    name: 'Навигация',
    links: [{
      name: 'Главная',
      link: '/'
    },{
      name: 'Преимущества',
      link: '/#features'
    },{
      name: 'Модели',
      link: '/#models'
    },{
      name: 'Комплектации',
      link: '/#packs'
    },{
      name: 'Кто мы',
      link: '/#about'
    },{
      name: 'Где купить',
      link: '/#where-to-buy'
    },]
  },
  models: {
    name: 'Модели',
    links: [{
      name: 'CS-12',
      link: '/drill/cs-12'
    },{
      name: 'CD-12',
      link: '/drill/cd-12'
    },{
      name: 'CID-21',
      link: '/drill/cid-21'
    },]
  },
  packs: {
    name: 'Комплектации',
    links: [{
      name: 'CD-12C',
      link: '/packs/cd-12c'
    },{
      name: 'CD-12ACC',
      link: '/packs/cd-12acc'
    },{
      name: 'CD-12TC',
      link: '/packs/cd-12tc'
    },{
      name: 'CID-21C',
      link: '/packs/cd-21c'
    },]
  }
}
</script>

<style scoped lang="scss">
footer {
  padding-top: 40px;
  padding-bottom: 40px;
  .info {
    width: 30%;
    display: flex;
    flex-direction: column;
    gap: 10px;

    p {
      margin-bottom: 20px;
    }
  }

  .links-wrapper {
    display: flex;
    margin-left: auto;
    justify-content: end;
    width: 70%;
    flex-direction: row;
    align-items: start;
    gap: 50px;

    h3 {
      margin-bottom: 15px;
    }
    .nav-wrapper {
      .links {
        display: flex;
        flex-direction: column;
        gap: 20px;
        text-align: start;
        justify-content: start;
        width: 100%;

        a {
          text-align: start;
          color: var(--SmokeLight, #F2F2F2);
          font-family: "Gotham Pro";
          font-size: 16px;
          font-style: normal;
          font-weight: 400;
          line-height: normal;
          margin-bottom: 5px;
          transition: .3s ease;
          opacity: .7;

          &:hover {
            opacity: 1;
          }
        }
      }
    }
  }

  .copyright {
    width: 100%;
    color: var(--SmokeGray, #DCDCDC);

    padding-top: 60px;
    padding-bottom: 20px;
    text-align: center;
    /* TORX P.DEFAULT */
    font-family: "Gotham Pro";
    font-size: 14px;
    font-style: normal;
    font-weight: 400;
    line-height: 16px; /* 114.286% */
  }
}
@media screen and (max-width: 992px) {
  footer {
    .row {
      flex-direction: column;
    }
    .info {
      width: 100%;
    }
    .links-wrapper {
      width: 100%;
      flex-direction: column;
      justify-content: start;
      margin-left: 0;
    }
    .copyright {
      text-align: left;
    }
  }
}
</style>
